catppuccin-cursors-macchiato
catppuccin-gtk-theme-macchiato
displaylink
downgrade
evdi-dkms
jbig2enc-git
lib32-nvidia-580xx-utils
mu
nvidia-580xx-dkms
ocrmypdf
paru
python312
realesrgan-ncnn-vulkan-bin
saleae-logic2
sioyek
soundfont-fatboy
syncthingtray-qt6
ttf-symbola
visual-studio-code-bin
wttrbar
