7zip
accountsservice
alsa-firmware
alsa-plugins
alsa-utils
aspell
audacity
b43-fwcutter
base
base-devel
bash-completion
bind
bluedevil
bluez
bluez-utils
breeze-gtk
breeze-plymouth
broadcom-wl-dkms
btrfs-progs
cantarell-fonts
ccache
cmake
cryptsetup
cups
cups-pdf
device-mapper
dfu-util
diffutils
direnv
discord
discover
dmidecode
dmraid
dnsmasq
docker
dosfstools
dracut
drkonqi
dtc
duf
e2fsprogs
efibootmgr
efitools
eigen
emacs
ethtool
exfatprogs
ex-vi-compat
eza
f2fs-tools
fastfetch
ffmpegthumbnailer
firefox
firewalld
flatpak-kcm
ghostty
gimp
git
git-filter-repo
glances
goocanvas
gperf
graphviz
grub
gsl
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
haveged
hdparm
hugo
hunspell-en_gb
hunspell-en_us
hunspell-pl
hwdetect
hwinfo
img2pdf
inetutils
intel-ucode
inxi
iptables
ipython
isoimagewriter
isync
iwd
jfsutils
jq
kde-gtk-config
kdeplasma-addons
keyd
kgamma
kicad
kinfocenter
kmenuedit
krdp
kscreen
ksshaskpass
kwallet-pam
kwin-x11
kwrited
languagetool
less
libdvdcss
libgsf
libopenraw
libreoffice-fresh
libwnck3
linux
linux-firmware
linux-headers
logrotate
lsb-release
lsof
lsscsi
luarocks
lvm2
man-db
man-pages
mdadm
meld
mesa-utils
modemmanager
mtools
nano
nano-syntax-highlighting
neovim
netctl
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
nss-mdns
ntfs-3g
ntp
obsidian
openbsd-netcat
openmpi
openssh
os-prober
oxygen
oxygen-cursors
oxygen-sounds
pacman-contrib
papers
papirus-icon-theme
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
plasma5support
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-keyboard
plasma-login-manager
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace-wallpapers
plocate
plymouth-kcm
polkit-kde-agent
poppler-glib
powerdevil
power-profiles-daemon
print-manager
pv
python
python-black
python-defusedxml
python-isort
python-packaging
python-pip
python-pipenv
python-pipx
python-pyflakes
python-pygraphviz
python-pyqt6
python-pytest
python-uv
qsynth
qt5-wayland
qt6-multimedia-ffmpeg
qt6-virtualkeyboard
rebuild-detector
reflector
resvg
rsync
rtkit
sg3_utils
shellcheck
shfmt
smartmontools
s-nail
sof-firmware
spectacle
spotify-launcher
starship
steam
stow
sudo
syncthing
sysfsutils
systemd-sysvcompat
systemsettings
tailscale
tcpdump
tesseract-data-eng
texinfo
texlive-basic
texlive-latexrecommended
texlive-plaingeneric
timeshift
tk
tldr
tree
ttf-bitstream-vera
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols-mono
ttf-opensans
unrar
unzip
upower
usb_modeswitch
usbutils
vim
vlc
vulkan-intel
vulkan-tools
wacomtablet
wev
wget
which
wireplumber
wireshark-qt
wl-clipboard
woff2-font-awesome
wpa_supplicant
xdg-desktop-portal-gtk
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xterm
yarn
yazi
zoxide
zsh
